export class AppLocales {

  public get ja(): any {
    return this._ja;
  }

  private _ja = {
    COMMON: {
      MENU: {
        AP: '承認',
        CN: '見積・契約',
        OP: '作業管理',
        RF: '紹介料管理',
        SD: '購買・在庫',
        GM: '汎用計上',
        AR: '請求',
        SV: '月次契約管理',
        BU: '業務マスター',
        SY: 'システム管理',
        CO: 'システム共通',
      }
    },

    AC010D01: {
      title: '売上計上ロック処理'
    },

    AC010D02: {
      title: '原価・支払計上ロック処理'
    },

    AC010D03: {
      title: '在庫変動ロック処理'
    },

    AP010D01: {
      title: '承認待ち一覧'
    },

    AP010D02: {
      title: '承認状況確認'
    },

    AP020D01: {
      title: '承認経路マスター一覧'
    },

    AP020D02: {
      title: '承認経路マスター登録'
    },

    AP030D01: {
      title: 'WF申請'
    },

    AP030D02: {
      title: 'WF承認'
    },

    AR010D02: {
      title: '請求予定確定'
    },

    AR010D03: {
      title: '請求予定確定データグルーピング・請求データ作成'
    },

    AR010D04: {
      title: '請求書一覧'
    },

    AR010D05: {
      title: '請求書詳細'
    },

    AR010D06: {
      title: '仕切書・納品書発行'
    },

    BU010D01: {
      title: '会社一覧'
    },

    BU010D02: {
      title: '会社マスター'
    },

    BU010D03: {
      title: '会社選択'
    },

    BU020D03: {
      title: '取引先選択'
    },

    BU020D04: {
      title: 'メインマスター選択'
    },

    BU020D05: {
      title: '回収条件編集'
    },

    BU020D06: {
      title: '支払条件編集'
    },

    BU030D01: {
      title: '請求書送付先一覧'
    },

    BU030D02: {
      title: '請求書送付先マスター'
    },

    BU030D03: {
      title: '請求書送付先選択'
    },

    BU040D01: {
      title: '紹介元施工先関係一覧'
    },

    BU040D02: {
      title: '紹介元施工先関係マスター'
    },

    BU080D01: {
      title: '物品一覧'
    },

    BU080D02: {
      title: '物品マスター'
    },

    BU080D03: {
      title: '物品選択'
    },

    BU090D01: {
      title: '仕入価格一覧'
    },

    BU090D02: {
      title: '仕入価格マスター'
    },

    BU100D01: {
      title: '販売価格一覧'
    },

    BU100D02: {
      title: '販売価格マスター'
    },

    BU110D01: {
      title: 'SDS一覧'
    },

    BU110D02: {
      title: 'SDSマスター'
    },

    BU110D03: {
      title: 'SDS選択'
    },

    BU120D01: {
      title: '成分一覧'
    },

    BU120D02: {
      title: '成分マスター'
    },

    BU120D03: {
      title: '成分選択'
    },

    BU130D01: {
      title: '倉庫一覧'
    },

    BU130D02: {
      title: '倉庫マスター'
    },

    BU130D03: {
      title: '倉庫選択'
    },

    BU140D01: {
      title: '在庫数量管理一覧'
    },

    BU140D02: {
      title: '在庫数量管理マスター'
    },

    CN010D01: {
      title: '見積・契約登録(見積基本)'
    },

    CN010D02: {
      title: '見積・契約登録(スケジュール)'
    },

    CN010D03: {
      title: '見積・契約登録(作業別金額表)'
    },

    CN010D04: {
      title: '見積・契約登録(見積書情報)'
    },

    CN010D05: {
      title: '見積・契約登録(紹介元管理)'
    },

    CN010D06: {
      title: '見積・契約登録(補足情報)'
    },

    CN010D07: {
      title: '見積・契約登録(関連ファイル)'
    },

    CN010D08: {
      title: '見積・契約登録(見積サマリー)'
    },

    CN010D09: {
      title: '見積・契約登録(契約書情報)'
    },

    CN010D10: {
      title: '見積・契約登録(契約サマリー)'
    },

    CN010D11: {
      title: '売上・原価　モーダルダイアログ'
    },

    CN010D12: {
      title: '請求予定　モーダルダイアログ'
    },

    CN010D13: {
      title: '代行店支払予定　モーダルダイアログ'
    },

    CN010D14: {
      title: '紹介料支払予定　モーダルダイアログ'
    },

    CN010D15: {
      title: '契約書類選択　モーダルダイアログ'
    },

    CN010D16: {
      title: '工種選択　モーダルダイアログ'
    },

    CN010D17: {
      title: '見積・契約一覧'
    },

    CN010D18: {
      title: '見積・契約登録(ESCO担当者管理)'
    },

    CN010D19: {
      title: '代行店変更'
    },

    CN010D20: {
      title: '紹介元変更'
    },

    CN010D21: {
      title: '見積・契約選択'
    },

    CN020D01: {
      title: '作業工程マスター一覧'
    },

    CN020D02: {
      title: '作業工程マスター'
    },

    CN020D03: {
      title: '作業選択'
    },

    CN020D04: {
      title: '作業テンプレート一覧'
    },

    CN020D05: {
      title: '作業テンプレート'
    },

    CN020D06: {
      title: '作業テンプレート選択'
    },

    CN030D01: {
      title: '契約書・スポット回収状況一覧'
    },

    CN030D02: {
      title: '契約回収遅延・未回収売上承認　モーダル'
    },

    CN040D01: {
      title: '契約解約登録・申請・承認'
    },

    GM010D01: {
      title: '売上一覧(サービス・物販・汎用)'
    },

    GM010D02: {
      title: '汎用伝票入力（債権）'
    },

    GM020D01: {
      title: '仕入一覧(サービス・物販・汎用)'
    },

    GM020D02: {
      title: '汎用伝票入力（債務）'
    },

    GM030D01: {
      title: '棚卸会計データ出力'
    },

    OP010D01: {
      title: '進捗一覧（代行店）'
    },

    OP010D02: {
      title: '進捗一覧（技術営業）'
    },

    OP010D03: {
      title: '進捗一覧（契約）'
    },

    OP010D04: {
      title: '実施工程一覧'
    },

    OP010D05: {
      title: '作業検収確認書・作業検収明細表出力指示'
    },

    OP020D01: {
      title: '売上・原価変更入力'
    },

    OP020D02: {
      title: '売上・原価変更入力（請求予定）'
    },

    OP020D03: {
      title: '売上・原価変更入力（代行店支払予定）'
    },

    OP020D04: {
      title: '売上・原価変更サマリー（承認）'
    },

    RF010D01: {
      title: '紹介料一覧'
    },

    RF010D02: {
      title: '紹介元売上明細一覧'
    },

    SD010D03: {
      title: '見積'
    },

    SD010D05: {
      title: '見積一覧'
    },

    SD010D06: {
      title: '受注'
    },

    SD010D07: {
      title: '受注一覧'
    },

    SD010D08: {
      title: '受注明細確定'
    },

    SD020D01: {
      title: '発注・仕入一覧'
    },

    SD020D02: {
      title: '発注・仕入'
    },

    SD030D01: {
      title: '仕入状況一覧'
    },

    SD030D02: {
      title: '仕入状況'
    },

    SD040D01: {
      title: '倉庫依頼一覧'
    },

    SD040D02: {
      title: '入庫予定一覧'
    },

    SD040D03: {
      title: '倉庫依頼'
    },

    SD040D04: {
      title: '倉庫入庫'
    },

    SD050D01: {
      title: '出庫・出荷状況'
    },

    SD050D02: {
      title: '出庫・出荷状況一覧'
    },

    SD050D03: {
      title: 'ロット・シリアル№'
    },

    SD050D04: {
      title: 'ロット・シリアル№一覧'
    },

    SD060D01: {
      title: '売上一覧'
    },

    SD060D02: {
      title: '売上金額修正'
    },

    SD070D01: {
      title: '棚卸一覧'
    },

    SD070D02: {
      title: '棚卸'
    },

    SD070D03: {
      title: '在庫一覧'
    },

    SD070D05: {
      title: '在庫引当'
    },

    SD080D01: {
      title: '他勘定振替一覧'
    },

    SD080D02: {
      title: '他勘定振替'
    },

    SD090D01: {
      title: '譲受書出力'
    },

    SD100D01: {
      title: '進捗一覧（物販）'
    },

    SD110D01: {
      title: '検収通知書発行（物販）'
    },

    SV110D01: {
      title: '契約移動関連付'
    },

    SV110D02: {
      title: '契約移動変更'
    },

    SV110D03: {
      title: '契約移動変更結果画面'
    },

    SV110D04: {
      title: '契約移動変更赤黒訂正'
    },

    SV110D05: {
      title: '契約移動事業部締指示画面（BI連携）'
    },

    SV110D06: {
      title: '契約移動本社締指示画面（BI連携）'
    },

    SY010D01: {
      title: '汎用マスター一覧'
    },

    SY010D02: {
      title: '汎用マスター登録'
    },

    SY010D03: {
      title: '汎用マスター選択'
    },

    SY010D04: {
      title: '汎用マスター種別選択'
    },

    SY020D01: {
      title: 'メニューグループ一覧'
    },

    SY020D02: {
      title: 'メニューグループ登録'
    },

    SY020D03: {
      title: 'メニューグループ選択'
    },

    SY020D04: {
      title: 'メニュー一覧'
    },

    SY020D05: {
      title: 'メニュー登録'
    },

    SY030D01: {
      title: 'メニュー権限一覧'
    },

    SY030D02: {
      title: 'メニュー権限マスター'
    },

    SY030D03: {
      title: 'メニュー権限選択'
    },

    SY040D01: {
      title: 'システム権限一覧'
    },

    SY040D02: {
      title: 'システム権限マスター'
    },

    SY040D03: {
      title: 'システム権限選択'
    },

    SY050D01: {
      title: '利用科目一覧'
    },

    SY050D02: {
      title: '利用科目マスター'
    },

    SY060D01: {
      title: '自社口座マスター'
    },

    SY070D01: {
      title: '配賦組織一覧'
    },

    SY080D01: {
      title: '銀行選択'
    },
  };

  /*zh_cn: {
  };*/
}
